#include <bits/stdc++.h>
using namespace std;
class Student
{
public:
    string name;
    int roll;
    int marks;
};
int main()
{
    int n;
    cin >> n;
    Student a[n];
    for (int i = 0; i < n; i++)
    {
        cin >> a[i].name >> a[i].roll >> a[i].marks;
    }
    Student mx;        // ম্যাক্সিমাম অবজেক্টটি বের করে স্টোর করার জন্য একটি অবজেক্ট নেওয়া হয়েছে।
    mx.marks = INT_MIN;      // যেহেতু আমরা মার্ক্স দেখে ম্যাক্সিমাম বের করব তাই এই অবজেক্ট এর মার্ক্স শুরুতে INT_MIN দিয়ে ইনিশিয়ালাইজ করা হয়েছে।  

    for (int i = 0; i < n; i++)   // তারপর নরমালি আমরা এরে থেকে মিনিমাম বের করার জন্য যেভাবে লুপ চালাতাম সেভাবে লুপ চালিয়ে এরের শুরু থেকে শেষ পর্যন্ত সবগুলো অবজেক্ট এর কাছে যাওয়া হচ্ছে।
    {
        if (a[i].marks > mx.marks)    // অবজেক্টের মার্ক্স এর সাথে আমাদের আন্সার অবজেক্ট এর মার্ক্স কম্পেয়ার করে দেখা হচ্ছে। যদি অবজেক্টের মার্ক্স বেশি হয় তাহলে এটিই আমাদের ম্যাক্সিমাম অবজেক্ট। তাই ম্যাক্সিমাম অবজেক্ট আপডেট করা হচ্ছে। 
        {
            mx = a[i];           // ম্যাক্সিমাম অবজেক্ট আপডেট করা হচ্ছে। 
        }
    }
    cout << mx.name << " " << mx.roll << " " << mx.marks << endl;   // ম্যাক্সিমাম অবজেক্ট প্রিন্ট করা হচ্ছে। 
    return 0;
}