#include<bits/stdc++.h>
using namespace std;

int main() {
    // একটি স্ট্রিং ভেরিয়েবল ঘোষণা
    string s;
    
    // স্ট্রিং ইনপুট নেয়া (স্পেস সহ)
    getline(cin, s);
    
    // একটি স্ট্রিং স্ট্রিম অবজেক্ট তৈরি
    stringstream ss;
    
    // স্ট্রিং স্ট্রিমে স্ট্রিং 's' 
    ss << s;
    
    // একটি স্ট্রিং ভেরিয়েবল 'word'  declare
    string word;
    
    // শব্দ গণনা করার জন্য একটি কাউন্টার ভেরিয়েবল 'cnt' ঘোষণা এবং শূন্য দিয়ে ইনিশিয়ালাইজ
    int cnt = 0;
    
    // লুপ চালিয়ে স্ট্রিং স্ট্রিম থেকে এক এক করে শব্দ পড়া এবং কাউন্ট করা
    while (ss >> word) {
        cnt++;
    }
    
    // মোট শব্দের সংখ্যা প্রিন্ট করা
    cout << cnt << endl;
    
    return 0;
}