#include<stdio.h>
int main()
{
    int x = 10;
    int* p;                  // x এর এড্রেস একটি পয়েন্টার ভেরিয়েবলে রাখা হচ্ছে। এখানে পয়েন্টার ভেরিয়েবলটি x কে পয়েন্ট করবে তাই এর ডাটা টাইপ হিসেবে int* দেওয়া হয়েছে। পয়েন্টার এর নাম p দেওয়া হয়েছে।
    p = &x;                  // x এর এড্রেস একটি পয়েন্টার ভেরিয়েবলে রাখা হচ্ছে। এখানে পয়েন্টার ভেরিয়েবলটি x কে পয়েন্ট করবে তাই এর ডাটা টাইপ হিসেবে int* দেওয়া হয়েছে। পয়েন্টার এর নাম p দেওয়া হয়েছে।
    printf("Address = %p\n",p);   // পয়েন্টার ভেরিয়েবলটি প্রিন্ট করা হচ্ছে।
}